car_des/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

	
    k
    {

        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-8;
        relTol          0.1;
    }

    omega
    {
       solver          smoothSolver;
       smoother        symGaussSeidel;

       tolerance       1e-8;
       relTol          0.1;
    }

    omegaFinal
    {
       $omega;
       relTol          0;
    }

    kFinal
    {
       $k;
       relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors         2;
    nCorrectors              2;
    nNonOrthogonalCorrectors 1;
    momentumPredictor        yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

cache
{
    grad(U);
}
// ************************************************************************* //
